### Terragrunt Plan :memo:

```text
time=2024-08-02T16:08:37Z level=info msg=The stack at terraform will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/homelab/homelab/terraform/aliyun


Acquiring state lock. This may take a few moments...
module.nixos_hgh2.data.external.build: Reading...
module.nixos_hgh1.data.external.build: Reading...
module.nixos_sin0.data.external.build: Reading...
module.nixos_hgh0.data.external.build: Reading...
module.nixos_sin0.data.external.keyscan: Reading...
module.nixos_sin0.data.external.keyscan: Read complete after 3s [id=-]
module.nixos_hgh2.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh1.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh0.data.external.build: Still reading... [10s elapsed]
module.nixos_sin0.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh2.data.external.build: Read complete after 19s [id=-]
module.nixos_hgh0.data.external.build: Read complete after 19s [id=-]
module.nixos_hgh1.data.external.build: Read complete after 19s [id=-]
module.nixos_sin0.data.external.build: Read complete after 20s [id=-]
module.nixos_hgh2.data.external.keyscan: Reading...
module.nixos_hgh0.data.external.keyscan: Reading...
module.nixos_hgh1.data.external.keyscan: Reading...
module.nixos_hgh2.data.external.keyscan: Read complete after 4s [id=-]
module.nixos_hgh0.data.external.keyscan: Read complete after 3s [id=-]
module.nixos_hgh1.data.external.keyscan: Read complete after 4s [id=-]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # alicloud_instance.hgh0 will be updated in-place
  ~ resource "alicloud_instance" "hgh0" {
        id                                 = "i-bp141zch5wpf792fhovg"
      ~ security_groups                    = [
          - "sg-bp1asx4zzxwgp97pmzxp",
        ] -> (known after apply)
        tags                               = {
            "Terraform" = "true"
        }
        # (43 unchanged attributes hidden)
    }

  # alicloud_instance.hgh1 will be updated in-place
  ~ resource "alicloud_instance" "hgh1" {
        id                                 = "i-bp1gkwv2qckx68s614x6"
      ~ security_groups                    = [
          - "sg-bp1asx4zzxwgp97pmzxp",
        ] -> (known after apply)
        tags                               = {
            "Terraform" = "true"
        }
        # (45 unchanged attributes hidden)
    }

  # alicloud_instance.hgh2 will be updated in-place
  ~ resource "alicloud_instance" "hgh2" {
        id                                 = "i-bp1fgtgt67nbd53ysp43"
      ~ security_groups                    = [
          - "sg-bp1asx4zzxwgp97pmzxp",
        ] -> (known after apply)
        tags                               = {
            "Terraform" = "true"
        }
        # (45 unchanged attributes hidden)
    }

  # module.nixos_hgh2.null_resource.deploy[0] is tainted, so it must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "6452738094946189853" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sg.alicloud_security_group.this must be replaced
-/+ resource "alicloud_security_group" "this" {
      + description         = "Hangzhou Security Group"
      ~ id                  = "sg-bp1asx4zzxwgp97pmzxp" -> (known after apply)
      ~ inner_access        = false -> (known after apply)
      + inner_access_policy = (known after apply)
      + name                = "hgh-sg"
      - tags                = {} -> null
      + vpc_id              = "vpc-bp1uxe2x9piyejy6r5x4s" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.sg.alicloud_security_group_rule.this["icmp:0.0.0.0/0:-1"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:icmp:-1/-1:intranet:0.0.0.0/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.sg.alicloud_security_group_rule.this["tcp:0.0.0.0/0:22"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:22/22:intranet:0.0.0.0/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.sg.alicloud_security_group_rule.this["tcp:0.0.0.0/0:25565"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:25565/25565:intranet:0.0.0.0/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.sg.alicloud_security_group_rule.this["tcp:0.0.0.0/0:443"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:443/443:intranet:0.0.0.0/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.sg.alicloud_security_group_rule.this["tcp:0.0.0.0/0:80"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:80/80:intranet:0.0.0.0/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.sg.alicloud_security_group_rule.this["tcp:::/0:22"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:22/22:intranet:__/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.sg.alicloud_security_group_rule.this["tcp:::/0:25565"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:25565/25565:intranet:__/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.sg.alicloud_security_group_rule.this["tcp:::/0:443"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:443/443:intranet:__/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.sg.alicloud_security_group_rule.this["tcp:::/0:80"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:80/80:intranet:__/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.sg.alicloud_security_group_rule.this["udp:0.0.0.0/0:3478"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:udp:3478/3478:intranet:0.0.0.0/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.sg.alicloud_security_group_rule.this["udp:::/0:3478"] must be replaced
-/+ resource "alicloud_security_group_rule" "this" {
      ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:udp:3478/3478:intranet:__/0:accept:1" -> (known after apply)
      + prefix_list_id    = (known after apply)
      ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 13 to add, 3 to change, 13 to destroy.
Releasing state lock. This may take a few moments...
```

**Status**: out of sync :warning: